adapters/fiducia-adapter/src/test/resources/pis/periodic-payments/pain.001-sepa-credit-transfers/initiate-payment.json

{
  "request": {
    "headers": {
      "X-Request-ID": "1ebad8ac-572c-4914-a1f5-fcd1ff657fa4",
      "Content-Type": "multipart/form-data",
      "PSU-IP-Address": "0.0.0.0",
      "PSU-ID": "VRK1234567890ALL",
      "PSU-ID-Type": "",
      "X-GTW-ASPSP-ID": "a7da261c-30d1-4491-a250-6aab784fbf2b"
    },
    "body": {
      "xml_sct": "<Document xmlns=\"urn:iso:std:iso:20022:tech:xsd:pain.001.001.03\">  <CstmrCdtTrfInitn>    <GrpHdr>      <MsgId>MIPI-123456789RI-123456789</MsgId>      <CreDtTm>2017-02-14T20:23:34.000Z</CreDtTm>      <NbOfTxs>1</NbOfTxs>      <CtrlSum>123</CtrlSum>      <InitgPty>        <Nm>PaymentInitiator</Nm>        <Id><OrgId><Othr><Id>DE10000000012</Id>          <SchmeNm><Prptry>PISP</Prptry></SchmeNm></Othr></OrgId></Id>      </InitgPty>    </GrpHdr>    <PmtInf>      <PmtInfId>BIPI-123456789RI-123456789</PmtInfId>      <PmtMtd>TRF</PmtMtd>      <NbOfTxs>1</NbOfTxs>      <CtrlSum>123</CtrlSum>      <PmtTpInf><SvcLvl><Cd>SEPA</Cd></SvcLvl></PmtTpInf>      <ReqdExctnDt>2017-02-15</ReqdExctnDt>      <Dbtr><Nm>PSU Name</Nm></Dbtr>      <DbtrAcct><Id><IBAN>DE39499999600000005111</IBAN></Id></DbtrAcct>      <ChrgBr>SLEV</ChrgBr>      <CdtTrfTxInf>        <PmtId><EndToEndId>RI-123456789</EndToEndId></PmtId>        <Amt><InstdAmt Ccy=\"EUR\">123</InstdAmt></Amt>        <Cdtr><Nm>Merchant123</Nm></Cdtr>        <CdtrAcct><Id><IBAN> DE23100120020123456789</IBAN></Id></CdtrAcct>        <RmtInf><Ustrd>Ref Number Merchant-123456</Ustrd></RmtInf>      </CdtTrfTxInf>    </PmtInf>  </CstmrCdtTrfInitn></Document>",
      "json_standingorderType": {
        "startDate": "2018-03-01",
        "executionRule": "following",
        "frequency": "Monthly",
        "dayOfExecution": "1"
      }
    }
  },
  "response": {
    "body": {
      "transactionStatus": "RCVD",
      "paymentId": "2750410619090020256PSDDE-BAFIN-911360PA4960JJ",
      "_links": {
        "startAuthorisationWithPsuAuthentication": {
          "href": "/v1/periodic-payments/pain.001-sepa-credit-transfers/2750410619090020256PSDDE-BAFIN-911360PA4960JJ/authorisations"
        }
      }
    }
  }
}
